#Как преобразовать число в строку?
str()
#Как используется оператор // в Python?
// - оператор деления
#Что такое функция range()?
Функция range () позволяет получать последовательности целых чисел 
в заданном диапазоне с определенным шагом
#Какие встроенные типы доступны в Python?
Числовые, string, последовательности, dict, bool; set, frozenset.
#Какие изменяемые типы данных имеются в Python?
список
словарь
множество
#Какие неизменяемые типы данных имеются в Python?
число
дробь
кортежт
строки
комплексные числа
bool
frozenset
#Основные плюсы питона?
доступнный, бесплатный, много библиотек, много пакетов, много инструментов 
#В чем разница между списками (list) и кортежами (tuple)?
список можно изменять, кортеж менять нельзя
#Что такое отрицательный индекс (negative index)?
отрицательный индекс это индекс для последнего символа в строке
#Как можно преобразовать строку (string) в нижний регистр?
string lower()
#Что такое срез?
для получения из строки не одиного символа, 
а сразу несколько по какой-нибудь закономерности
#Как пишутся комментарии в питоне?
перед строй которую нужно закоментить ставится #
#Как перевести первый символ строки в верхний регистр?
upper()
#Как можно обратить (reverse) порядок элементов в списке?
family = ['mom', 'dad', 'son'] 
print(family)
family.reverse()
print(family)
#Что такое словарь (dictionary)?
Словарь это неупорядоченный список. 
Записи в словаре не имеют индексов
#Что такое строка документации (docstring)?
#Как можно принять результат ввода на клавиатуре?
input
#Расскажите про генераторы списков (list comprehension).
#Что такое РЕР8
PEP8 общие правила принятые программистами